2883. Drop Missing Data

DataFrame students
+-------------+--------+
| Column Name | Type   |
+-------------+--------+
| student_id  | int    |
| name        | object |
| age         | int    |
+-------------+--------+
There are some rows having missing values in the name column.

Write a solution to remove the rows with missing values.

The result format is in the following example.

 

Example 1:

Input:
+------------+---------+-----+
| student_id | name    | age |
+------------+---------+-----+
| 32         | Piper   | 5   |
| 217        | None    | 19  |
| 779        | Georgia | 20  |
| 849        | Willow  | 14  |
+------------+---------+-----+
Output:
+------------+---------+-----+
| student_id | name    | age |
+------------+---------+-----+
| 32         | Piper   | 5   |
| 779        | Georgia | 20  | 
| 849        | Willow  | 14  | 
+------------+---------+-----+
Explanation: 
Student with id 217 havs empty value in the name column, so it will be removed.

In [2]:
import pandas as pd

data = {"student_id":[32,217,779,849], "name":["Piper",None,"Georgia","Willow"], "age":[5,19,20,14]}

students = pd.DataFrame(data)

display(students)

   student_id     name  age
0          32    Piper    5
1         217     None   19
2         779  Georgia   20
3         849   Willow   14

In [3]:
# the most obvious solution to this seems like

output = students.dropna()

In [5]:
output

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

In [7]:
# however, it isn't, cause dropna will check for null values in all columns and will also delete rows which have nulls in any other column, not just name

output = students.dropna(subset=["name"])

# so always specify list of columns which need to be checked
# P.S.: dropna() does not modify orignal dataframe, always assign to new variable

display(output)

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14